app/controllers/api/v1/venues_controller.rb

  def index
    venues = Venue.all.sort_by{ |v| v.reviews.length }.reverse
---
SELECT "venues".* FROM "venues"

  def show
    venue = Venue.find(params[:id])
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]